"""
Пусть у нас есть функция, которая должна извлекать из базы данных какую-то информацию.
На начальном этапе разработки мы не заботились о том, что это можно делать только при условии,
что пользователь программы авторизовался, но сейчас время пришло.
"""

yesno = input("""Введите Y, если хотите авторизоваться или N, 
             если хотите продолжить работу как анонимный пользователь: """)

auth = yesno == "Y"


def is_auth(func) :
    def wrapper() :
        if auth :
            print("Пользователь авторизован")
            func()
        else :
            print("Пользователь неавторизован. Функция выполнена не будет")

    return wrapper


@is_auth
def from_db() :
    print("some data from database")


from_db()

"""
Итак, разберем код по частям. Сначала мы спрашиваем у пользователя, хочет ли он авторизоваться. 
При авторизации на сайтах вы, наверное, не раз встречали такую ситуацию, что браузер помнит ваши 
логин и пароль, и не нужно их вводить каждый раз. Представим, что именно это мы и сделали — 
для авторизации достаточно ввести Y. После чего в переменную auth сохранили True, если 
пользователь авторизован.

Следующий блок кода — сам декоратор, который в случае успешной авторизации выводит соответствующее 
сообщение и выполняет функцию. Если же пользователь не авторизовался, то также получаем соответствующее 
сообщение, но уже без вызова самой функции!

Самая главная фишка декораторов в том, что такую обертку можно использовать для многих функций. 
Если в нашу программу хотим добавить еще одну функцию, для которой мы бы хотели сначала проверить 
авторизацию пользователя, достаточно всего лишь указать для нее декоратор.

@is_auth
def change_profile():
    print("Profile has been changed")
"""