# Задание 4.1.1
# Задание на самопроверку.
#
# Напишите функцию print_2_add_2, которая будет складывать 2 и 2, а затем печатать этот результат.
# Не забудьте вызвать функцию, чтобы увидеть результат.
def print_2_and_2():
    result = 2 + 2
    print(result)

print_2_and_2()

