# Задание 4.1.2
# Задание на самопроверку.
#
# Напишите функцию hello_world, которая будет печать приветственную строку "Hello World".
def hello_world():
    print("Hello World")


hello_world()
