
G = {"Адмиралтейская" :
         {"Садовая": 2},
     "Садовая" :
         {"Сенная площадь": 4,
          "Спасская": 3,
          "Адмиралтейская": 2,
          "Звенигородская": 3},
     "Сенная площадь" :
         {"Садовая": 4,
          "Спасская": 4},
     "Спасская" :
         {"Садовая": 3,
          "Сенная площадь": 4,
          "Достоевская": 4},
     "Звенигородская" :
         {"Пушкинская": 3,
          "Садовая": 3},
     "Пушкинская" :
         {"Звенигородская": 3,
          "Владимирская": 2},
     "Владимирская" :
         {"Достоевская": 3,
          "Пушкинская": 2},
     "Достоевская" :
         {"Владимирская": 3,
          "Спасская": 4}}

print(G)