# Задание 4.4.9
# Дано натуральное восьмизначное число. Выясните, палиндром ли оно (читается одинаково слева направо и справа налево).
#
# (Подсказка: использовать целочисленное деление и деление с остатком не нужно. Попробуйте преобразовать число к строке,
# а потом перевернуть эту строку. См. материал прошлого модуля).

num = input("Введите восьмизначное число --> ")

print(list(num))